### Working with pandas dataframes

[Official Documentation](https://pandas.pydata.org/docs/)

[Course page](https://ds.codeup.com/python/dataframes/)

<div class="alert alert-block alert-info">

#### Learning Goals
    
- Understand the structure of a dataframe
- View information about the contents of a dataframe
- Determine attributes of the data within the dataframe
- Manipulate columns
- Sort and filter contents of dataframe
- Create, modify, and drop columns
- View descriptive statistics for data

### Sources of dataframes

- Created from dictionaries, lists, or arrays
- Imported from Python libraries (e.g. `pydataset`)
- Read from `csv`, `tsv`, `xlsx` files
- SQL databases

---

### Import statements

In [73]:
# Imported libraries
import pandas as pd

# Numpy to build arrays
import numpy as np

# Source of datasets
from pydataset import data

# Set a value to initialize the random integer generation
np.random.seed(123)

---

## Creating a dataframe

- Combine multiple series of equal length.

In [5]:
# Create a list of students
students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas', 'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

In [6]:

# Randomly generate 12 scores for each subject (1 per student)
# Store values as arrays
# Note that all the values need to have the same length here

math_grades = np.random.randint(low=60, high=100, size=len(students))

english_grades = np.random.randint(low=60, high=100, size=len(students))

reading_grades = np.random.randint(low=60, high=100, size=len(students))

In [7]:
# Create a dictionary with structure:
# 'column_name': <array or list>

df_dict = {'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades}

In [8]:

# Use pd.DataFrame
df = pd.DataFrame(df_dict)

# View the type
type(df)

pandas.core.frame.DataFrame

In [9]:
display(df)

       name  math  english  reading
0     Sally    63       90       80
1      Jane    65       66       72
2     Suzie    60       86       78
3     Billy    71       76       77
4       Ada    94       66       61
5      John    70       74       87
6    Thomas    82       99       82
7     Marie    73       71       63
8    Albert    78       67       63
9   Richard    96       61       71
10    Isaac    75       97       81
11     Alan    87       85       85

### Check data types

### Display a table for the dataframe

### Dimension of dataframe

Format: A tuple with (rows, columns)

### View portions of the dataframe

```python
.head(n) # first n rows (default = 5 rows)
.tail(n) # last n rows (default = 5 rows)
.sample(n) # randomly select n rows (default = 1 row)
```

In [10]:
df.head()

    name  math  english  reading
0  Sally    63       90       80
1   Jane    65       66       72
2  Suzie    60       86       78
3  Billy    71       76       77
4    Ada    94       66       61

In [11]:
df.tail()

       name  math  english  reading
7     Marie    73       71       63
8    Albert    78       67       63
9   Richard    96       61       71
10    Isaac    75       97       81
11     Alan    87       85       85

In [12]:
df.sample(2)

   name  math  english  reading
4   Ada    94       66       61
1  Jane    65       66       72

### Information about the dataframe's contents

| Name | Description |
| ---:|:------ |
|`#`  | The row index|
|`Column`| Index/name of column (a string) |
|`Non-Null Count` | Number of non-empty values 
|`Dtype` |    The data type |

### Data types

In [14]:
df.dtypes

name       object
math        int64
english     int64
reading     int64
dtype: object

### Descriptive Statistics

In [15]:
df.describe()

            math    english    reading
count  12.000000  12.000000  12.000000
mean   76.166667  78.166667  75.000000
std    11.683970  12.882923   8.923921
min    60.000000  61.000000  61.000000
25%    68.750000  66.750000  69.000000
50%    74.000000  75.000000  77.500000
75%    83.250000  87.000000  81.250000
max    96.000000  99.000000  87.000000

In [16]:
df.describe().round()

       math  english  reading
count  12.0     12.0     12.0
mean   76.0     78.0     75.0
std    12.0     13.0      9.0
min    60.0     61.0     61.0
25%    69.0     67.0     69.0
50%    74.0     75.0     78.0
75%    83.0     87.0     81.0
max    96.0     99.0     87.0

---

## Working with Columns

- View column information
- Rename columns
- Drop columns

### View Column Information

In [18]:
df.columns

Index(['name', 'math', 'english', 'reading'], dtype='object')

### Check data types

In [20]:
col_list = df.columns.tolist()

In [21]:
type(col_list)

list

In [22]:
index_list = df.index.tolist()

In [23]:
type(index_list)

list

<div class="alert alert-block alert-info">
    
### Important Notes
    
- Keep in mind what data structure you are working with
- Recall that methods do not alter the original data structure
- Check documentation for what the parameters and results of a pandas function are

### Dropping columns

- Drop all columns except for the student's name and math grade
- Assign the results to a new dataframe

In [26]:
df.drop(columns = ['english', 'reading'])

       name  math
0     Sally    63
1      Jane    65
2     Suzie    60
3     Billy    71
4       Ada    94
5      John    70
6    Thomas    82
7     Marie    73
8    Albert    78
9   Richard    96
10    Isaac    75
11     Alan    87

In [28]:
df

       name  math  english  reading
0     Sally    63       90       80
1      Jane    65       66       72
2     Suzie    60       86       78
3     Billy    71       76       77
4       Ada    94       66       61
5      John    70       74       87
6    Thomas    82       99       82
7     Marie    73       71       63
8    Albert    78       67       63
9   Richard    96       61       71
10    Isaac    75       97       81
11     Alan    87       85       85


### Tip

- Create a list with the columns you want to drop

In [29]:
dropped_columns = ['english', 'reading']

In [30]:
df.drop(columns = dropped_columns)

       name  math
0     Sally    63
1      Jane    65
2     Suzie    60
3     Billy    71
4       Ada    94
5      John    70
6    Thomas    82
7     Marie    73
8    Albert    78
9   Richard    96
10    Isaac    75
11     Alan    87

### Renaming columns

- Rename the columne `name` to `student`
- Use a dictionary structure
- Assign to a new dataframe

```python
{'old_name': 'new_name'}
```

In [31]:
df.columns

Index(['name', 'math', 'english', 'reading'], dtype='object')

In [32]:
df.rename(columns = {'name':'student'})

    student  math  english  reading
0     Sally    63       90       80
1      Jane    65       66       72
2     Suzie    60       86       78
3     Billy    71       76       77
4       Ada    94       66       61
5      John    70       74       87
6    Thomas    82       99       82
7     Marie    73       71       63
8    Albert    78       67       63
9   Richard    96       61       71
10    Isaac    75       97       81
11     Alan    87       85       85

### Selecting a column

In [39]:
math_series = df['math']
type(math_series)

pandas.core.series.Series

In [33]:
math_performance = df['math'] # <<<< this is a series

In [34]:
type(math_performance)

pandas.core.series.Series

In [37]:
math_performance = df[['math']] # <<<< this is a df

In [38]:
type(math_performance)

pandas.core.frame.DataFrame

In [40]:
math_values = df.math
type(math_values)

pandas.core.series.Series

### Creating new columns


- Use a comparison operator on a column to return Boolean values 
- Create a new column with these contents
- Use assign to set the column values equal to the Boolean values

In [41]:
df['passing_math'] = df.math >= 70

In [43]:
df

       name  math  english  reading  passing_math
0     Sally    63       90       80         False
1      Jane    65       66       72         False
2     Suzie    60       86       78         False
3     Billy    71       76       77          True
4       Ada    94       66       61          True
5      John    70       74       87          True
6    Thomas    82       99       82          True
7     Marie    73       71       63          True
8    Albert    78       67       63          True
9   Richard    96       61       71          True
10    Isaac    75       97       81          True
11     Alan    87       85       85          True

In [46]:
df_high_score_math = df[df.math >= 90]
df_high_score_math

      name  math  english  reading  passing_math
4      Ada    94       66       61          True
9  Richard    96       61       71          True

---

### Sorting dataframes

- Use `.sort_values`
- set which column to sort by
- Set ascending or descending

In [48]:
df.sort_values(by = 'english', ascending = False)

       name  math  english  reading  passing_math
6    Thomas    82       99       82          True
10    Isaac    75       97       81          True
0     Sally    63       90       80         False
2     Suzie    60       86       78         False
11     Alan    87       85       85          True
3     Billy    71       76       77          True
5      John    70       74       87          True
7     Marie    73       71       63          True
8    Albert    78       67       63          True
1      Jane    65       66       72         False
4       Ada    94       66       61          True
9   Richard    96       61       71          True

In [50]:
df[df.english > 90].sort_values(by = 'english').head(1).name

10    Isaac
Name: name, dtype: object

### Chaining Operations

---

## Importing datasets

```python
import pandas as pd
from pydataset import data
```

In [66]:
data('mpg', show_doc = True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

### View available datasets

---
<div class="alert alert-block alert-success">
    
### In-class exercise 

- Randomly select one dataset from `pydataset`
- Load the dataset as a dataframe
- View information about the dataset

In [74]:
data()

        dataset_id                                             title
0    AirPassengers       Monthly Airline Passenger Numbers 1949-1960
1          BJsales                 Sales Data with Leading Indicator
2              BOD                         Biochemical Oxygen Demand
3     Formaldehyde                     Determination of Formaldehyde
4     HairEyeColor         Hair and Eye Color of Statistics Students
..             ...                                               ...
752        VerbAgg                  Verbal Aggression item responses
753           cake                 Breakage Angle of Chocolate Cakes
754           cbpp                 Contagious bovine pleuropneumonia
755    grouseticks  Data on red grouse ticks from Elston et al. 2001
756     sleepstudy       Reaction times in a sleep deprivation study

[757 rows x 2 columns]

In [75]:
bj_data = data('BJsales')

In [76]:
data('BJsales', show_doc=True)

BJsales

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Sales Data with Leading Indicator

### Description

The sales time series `BJsales` and leading indicator `BJsales.lead` each
contain 150 observations. The objects are of class `"ts"`.

### Usage

    BJsales
    BJsales.lead

### Source

The data are given in Box & Jenkins (1976). Obtained from the Time Series Data
Library at http://www-personal.buseco.monash.edu.au/~hyndman/TSDL/

### References

G. E. P. Box and G. M. Jenkins (1976): _Time Series Analysis, Forecasting and
Control_, Holden-Day, San Francisco, p. 537.

P. J. Brockwell and R. A. Davis (1991): _Time Series: Theory and Methods_,
Second edition, Springer Verlag, NY, pp. 414.


---

### Logical Operators


 `&`    and 
 
 `|`    or
 
 `not`  not

### Find students who are eligible for:

- High-performer award (At leat 80 in Math and English)
- Subject award (at least 90 in a subject)
- Exemplary award (at least 90 in all subjects)

In [81]:
df[(df['math'] >= 80) & (df['english'] >=80)]

      name  math  english  reading  passing_math
6   Thomas    82       99       82          True
11    Alan    87       85       85          True

In [80]:
df[(df['math'] >= 90) | (df['reading'] >= 90) | (df['english'] >=90)]

       name  math  english  reading  passing_math
0     Sally    63       90       80         False
4       Ada    94       66       61          True
6    Thomas    82       99       82          True
9   Richard    96       61       71          True
10    Isaac    75       97       81          True

In [79]:
df[(df['math'] >= 90) & (df['reading'] >= 90) & (df['english'] >=90)]

Empty DataFrame
Columns: [name, math, english, reading, passing_math]
Index: []